/*
 * load_mot.h
 *
 *  Created on: 2011/03/28
 *      Author: mizu
 */

#ifndef LOAD_MOT_H_
#define LOAD_MOT_H_

/********************************************************************************
	ヘッダーレコード
 ********************************************************************************/
struct mot_S0
{
	char record[2];		// レコード形式
	char byte_count[2];	// バイトカウント
	char load_addr[4];	// ロードアドレス
};
/********************************************************************************
	データレコード
 ********************************************************************************/
struct mot_S1
{
	char record[2];		// レコード形式
	char byte_count[2];	// バイトカウント
	char load_addr[4];	// ロードアドレス(2byteアドレス)
};

struct mot_S2
{
	char record[2];		// レコード形式
	char byte_count[2];	// バイトカウント
	char load_addr[6];	// ロードアドレス(3byteアドレス)
};

struct mot_S3
{
	char record[2];		// レコード形式
	char byte_count[2];	// バイトカウント
	char load_addr[8];	// ロードアドレス(4byteアドレス)
};

/********************************************************************************
	エンドレコード
 ********************************************************************************/
struct mot_S7
{
	char record[2];
	char byte_count[2];
	char load_addr[4];
};

struct mot_S8
{
	char record[2];
	char byte_count[2];
	char load_addr[6];
};

struct mot_S9
{
	char record[2];
	char byte_count[2];
	char load_addr[8];
};


/********************************************************************************
	プロトタイプ宣言
********************************************************************************/
void mot_deploy(char* buf);

#endif /* LOAD_MOT_H_ */
